docs/evidence/run-2-vpa-requests/11-zero-downtime-k6.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: load/rollout-check.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 2m30s max duration (incl. graceful stop):
              * default: 10 looping VUs for 2m0s (gracefulStop: 30s)


running (0m01.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [   1% ] 10 VUs  0m01.0s/2m0s

running (0m02.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  0m02.0s/2m0s

running (0m03.0s), 10/10 VUs, 140 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  0m03.0s/2m0s

running (0m04.0s), 10/10 VUs, 190 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  0m04.0s/2m0s

running (0m05.0s), 10/10 VUs, 240 complete and 0 interrupted iterations
default   [   4% ] 10 VUs  0m05.0s/2m0s

running (0m06.0s), 10/10 VUs, 290 complete and 0 interrupted iterations
default   [   5% ] 10 VUs  0m06.0s/2m0s

running (0m07.0s), 10/10 VUs, 340 complete and 0 interrupted iterations
default   [   6% ] 10 VUs  0m07.0s/2m0s

running (0m08.0s), 10/10 VUs, 390 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  0m08.0s/2m0s

running (0m09.0s), 10/10 VUs, 432 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  0m09.0s/2m0s

running (0m10.0s), 10/10 VUs, 480 complete and 0 interrupted iterations
default   [   8% ] 10 VUs  0m10.0s/2m0s

running (0m11.0s), 10/10 VUs, 530 complete and 0 interrupted iterations
default   [   9% ] 10 VUs  0m11.0s/2m0s

running (0m12.0s), 10/10 VUs, 580 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  0m12.0s/2m0s

running (0m13.0s), 10/10 VUs, 630 complete and 0 interrupted iterations
default   [  11% ] 10 VUs  0m13.0s/2m0s

running (0m14.0s), 10/10 VUs, 680 complete and 0 interrupted iterations
default   [  12% ] 10 VUs  0m14.0s/2m0s

running (0m15.0s), 10/10 VUs, 730 complete and 0 interrupted iterations
default   [  12% ] 10 VUs  0m15.0s/2m0s

running (0m16.0s), 10/10 VUs, 780 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  0m16.0s/2m0s

running (0m17.0s), 10/10 VUs, 830 complete and 0 interrupted iterations
default   [  14% ] 10 VUs  0m17.0s/2m0s

running (0m18.0s), 10/10 VUs, 880 complete and 0 interrupted iterations
default   [  15% ] 10 VUs  0m18.0s/2m0s

running (0m19.0s), 10/10 VUs, 920 complete and 0 interrupted iterations
default   [  16% ] 10 VUs  0m19.0s/2m0s

running (0m20.0s), 10/10 VUs, 970 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  0m20.0s/2m0s

running (0m21.0s), 10/10 VUs, 1020 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  0m21.0s/2m0s

running (0m22.0s), 10/10 VUs, 1070 complete and 0 interrupted iterations
default   [  18% ] 10 VUs  0m22.0s/2m0s

running (0m23.0s), 10/10 VUs, 1120 complete and 0 interrupted iterations
default   [  19% ] 10 VUs  0m23.0s/2m0s

running (0m24.0s), 10/10 VUs, 1170 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  0m24.0s/2m0s

running (0m25.0s), 10/10 VUs, 1220 complete and 0 interrupted iterations
default   [  21% ] 10 VUs  0m25.0s/2m0s

running (0m26.0s), 10/10 VUs, 1270 complete and 0 interrupted iterations
default   [  22% ] 10 VUs  0m26.0s/2m0s

running (0m27.0s), 10/10 VUs, 1314 complete and 0 interrupted iterations
default   [  22% ] 10 VUs  0m27.0s/2m0s

running (0m28.0s), 10/10 VUs, 1360 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  0m28.0s/2m0s

running (0m29.0s), 10/10 VUs, 1410 complete and 0 interrupted iterations
default   [  24% ] 10 VUs  0m29.0s/2m0s

running (0m30.0s), 10/10 VUs, 1460 complete and 0 interrupted iterations
default   [  25% ] 10 VUs  0m30.0s/2m0s

running (0m31.0s), 10/10 VUs, 1510 complete and 0 interrupted iterations
default   [  26% ] 10 VUs  0m31.0s/2m0s

running (0m32.0s), 10/10 VUs, 1560 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  0m32.0s/2m0s

running (0m33.0s), 10/10 VUs, 1610 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  0m33.0s/2m0s

running (0m34.0s), 10/10 VUs, 1660 complete and 0 interrupted iterations
default   [  28% ] 10 VUs  0m34.0s/2m0s

running (0m35.0s), 10/10 VUs, 1710 complete and 0 interrupted iterations
default   [  29% ] 10 VUs  0m35.0s/2m0s

running (0m36.0s), 10/10 VUs, 1751 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  0m36.0s/2m0s

running (0m37.0s), 10/10 VUs, 1801 complete and 0 interrupted iterations
default   [  31% ] 10 VUs  0m37.0s/2m0s

running (0m38.0s), 10/10 VUs, 1850 complete and 0 interrupted iterations
default   [  32% ] 10 VUs  0m38.0s/2m0s

running (0m39.0s), 10/10 VUs, 1900 complete and 0 interrupted iterations
default   [  32% ] 10 VUs  0m39.0s/2m0s

running (0m40.0s), 10/10 VUs, 1950 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  0m40.0s/2m0s

running (0m41.0s), 10/10 VUs, 2000 complete and 0 interrupted iterations
default   [  34% ] 10 VUs  0m41.0s/2m0s

running (0m42.0s), 10/10 VUs, 2050 complete and 0 interrupted iterations
default   [  35% ] 10 VUs  0m42.0s/2m0s

running (0m43.0s), 10/10 VUs, 2100 complete and 0 interrupted iterations
default   [  36% ] 10 VUs  0m43.0s/2m0s

running (0m44.0s), 10/10 VUs, 2150 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  0m44.0s/2m0s

running (0m45.0s), 10/10 VUs, 2195 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  0m45.0s/2m0s

running (0m46.0s), 10/10 VUs, 2243 complete and 0 interrupted iterations
default   [  38% ] 10 VUs  0m46.0s/2m0s

running (0m47.0s), 10/10 VUs, 2292 complete and 0 interrupted iterations
default   [  39% ] 10 VUs  0m47.0s/2m0s

running (0m48.0s), 10/10 VUs, 2340 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  0m48.0s/2m0s

running (0m49.0s), 10/10 VUs, 2390 complete and 0 interrupted iterations
default   [  41% ] 10 VUs  0m49.0s/2m0s

running (0m50.0s), 10/10 VUs, 2440 complete and 0 interrupted iterations
default   [  42% ] 10 VUs  0m50.0s/2m0s

running (0m51.0s), 10/10 VUs, 2490 complete and 0 interrupted iterations
default   [  42% ] 10 VUs  0m51.0s/2m0s

running (0m52.0s), 10/10 VUs, 2540 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  0m52.0s/2m0s

running (0m53.0s), 10/10 VUs, 2585 complete and 0 interrupted iterations
default   [  44% ] 10 VUs  0m53.0s/2m0s

running (0m54.0s), 10/10 VUs, 2635 complete and 0 interrupted iterations
default   [  45% ] 10 VUs  0m54.0s/2m0s

running (0m55.0s), 10/10 VUs, 2685 complete and 0 interrupted iterations
default   [  46% ] 10 VUs  0m55.0s/2m0s

running (0m56.0s), 10/10 VUs, 2735 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  0m56.0s/2m0s

running (0m57.0s), 10/10 VUs, 2783 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  0m57.0s/2m0s

running (0m58.0s), 10/10 VUs, 2830 complete and 0 interrupted iterations
default   [  48% ] 10 VUs  0m58.0s/2m0s

running (0m59.0s), 10/10 VUs, 2880 complete and 0 interrupted iterations
default   [  49% ] 10 VUs  0m59.0s/2m0s

running (1m00.0s), 10/10 VUs, 2930 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  1m00.0s/2m0s

running (1m01.0s), 10/10 VUs, 2979 complete and 0 interrupted iterations
default   [  51% ] 10 VUs  1m01.0s/2m0s

running (1m02.0s), 10/10 VUs, 3026 complete and 0 interrupted iterations
default   [  52% ] 10 VUs  1m02.0s/2m0s

running (1m03.0s), 10/10 VUs, 3075 complete and 0 interrupted iterations
default   [  52% ] 10 VUs  1m03.0s/2m0s

running (1m04.0s), 10/10 VUs, 3125 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  1m04.0s/2m0s

running (1m05.0s), 10/10 VUs, 3175 complete and 0 interrupted iterations
default   [  54% ] 10 VUs  1m05.0s/2m0s

running (1m06.0s), 10/10 VUs, 3225 complete and 0 interrupted iterations
default   [  55% ] 10 VUs  1m06.0s/2m0s

running (1m07.0s), 10/10 VUs, 3273 complete and 0 interrupted iterations
default   [  56% ] 10 VUs  1m07.0s/2m0s

running (1m08.0s), 10/10 VUs, 3321 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  1m08.0s/2m0s

running (1m09.0s), 10/10 VUs, 3370 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  1m09.0s/2m0s

running (1m10.0s), 10/10 VUs, 3420 complete and 0 interrupted iterations
default   [  58% ] 10 VUs  1m10.0s/2m0s

running (1m11.0s), 10/10 VUs, 3468 complete and 0 interrupted iterations
default   [  59% ] 10 VUs  1m11.0s/2m0s

running (1m12.0s), 10/10 VUs, 3517 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  1m12.0s/2m0s

running (1m13.0s), 10/10 VUs, 3565 complete and 0 interrupted iterations
default   [  61% ] 10 VUs  1m13.0s/2m0s

running (1m14.0s), 10/10 VUs, 3615 complete and 0 interrupted iterations
default   [  62% ] 10 VUs  1m14.0s/2m0s

running (1m15.0s), 10/10 VUs, 3665 complete and 0 interrupted iterations
default   [  62% ] 10 VUs  1m15.0s/2m0s

running (1m16.0s), 10/10 VUs, 3711 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  1m16.0s/2m0s

running (1m17.0s), 10/10 VUs, 3761 complete and 0 interrupted iterations
default   [  64% ] 10 VUs  1m17.0s/2m0s

running (1m18.0s), 10/10 VUs, 3811 complete and 0 interrupted iterations
default   [  65% ] 10 VUs  1m18.0s/2m0s

running (1m19.0s), 10/10 VUs, 3861 complete and 0 interrupted iterations
default   [  66% ] 10 VUs  1m19.0s/2m0s

running (1m20.0s), 10/10 VUs, 3911 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  1m20.0s/2m0s

running (1m21.0s), 10/10 VUs, 3960 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  1m21.0s/2m0s

running (1m22.0s), 10/10 VUs, 4005 complete and 0 interrupted iterations
default   [  68% ] 10 VUs  1m22.0s/2m0s

running (1m23.0s), 10/10 VUs, 4055 complete and 0 interrupted iterations
default   [  69% ] 10 VUs  1m23.0s/2m0s

running (1m24.0s), 10/10 VUs, 4101 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  1m24.0s/2m0s

running (1m25.0s), 10/10 VUs, 4151 complete and 0 interrupted iterations
default   [  71% ] 10 VUs  1m25.0s/2m0s

running (1m26.0s), 10/10 VUs, 4201 complete and 0 interrupted iterations
default   [  72% ] 10 VUs  1m26.0s/2m0s

running (1m27.0s), 10/10 VUs, 4251 complete and 0 interrupted iterations
default   [  72% ] 10 VUs  1m27.0s/2m0s

running (1m28.0s), 10/10 VUs, 4301 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  1m28.0s/2m0s

running (1m29.0s), 10/10 VUs, 4351 complete and 0 interrupted iterations
default   [  74% ] 10 VUs  1m29.0s/2m0s

running (1m30.0s), 10/10 VUs, 4401 complete and 0 interrupted iterations
default   [  75% ] 10 VUs  1m30.0s/2m0s

running (1m31.0s), 10/10 VUs, 4446 complete and 0 interrupted iterations
default   [  76% ] 10 VUs  1m31.0s/2m0s

running (1m32.0s), 10/10 VUs, 4492 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  1m32.0s/2m0s

running (1m33.0s), 10/10 VUs, 4541 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  1m33.0s/2m0s

running (1m34.0s), 10/10 VUs, 4591 complete and 0 interrupted iterations
default   [  78% ] 10 VUs  1m34.0s/2m0s

running (1m35.0s), 10/10 VUs, 4641 complete and 0 interrupted iterations
default   [  79% ] 10 VUs  1m35.0s/2m0s

running (1m36.0s), 10/10 VUs, 4691 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  1m36.0s/2m0s

running (1m37.0s), 10/10 VUs, 4741 complete and 0 interrupted iterations
default   [  81% ] 10 VUs  1m37.0s/2m0s

running (1m38.0s), 10/10 VUs, 4791 complete and 0 interrupted iterations
default   [  82% ] 10 VUs  1m38.0s/2m0s

running (1m39.0s), 10/10 VUs, 4841 complete and 0 interrupted iterations
default   [  82% ] 10 VUs  1m39.0s/2m0s

running (1m40.0s), 10/10 VUs, 4891 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  1m40.0s/2m0s

running (1m41.0s), 10/10 VUs, 4934 complete and 0 interrupted iterations
default   [  84% ] 10 VUs  1m41.0s/2m0s

running (1m42.0s), 10/10 VUs, 4981 complete and 0 interrupted iterations
default   [  85% ] 10 VUs  1m42.0s/2m0s

running (1m43.0s), 10/10 VUs, 5031 complete and 0 interrupted iterations
default   [  86% ] 10 VUs  1m43.0s/2m0s

running (1m44.0s), 10/10 VUs, 5081 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  1m44.0s/2m0s

running (1m45.0s), 10/10 VUs, 5131 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  1m45.0s/2m0s

running (1m46.0s), 10/10 VUs, 5181 complete and 0 interrupted iterations
default   [  88% ] 10 VUs  1m46.0s/2m0s

running (1m47.0s), 10/10 VUs, 5231 complete and 0 interrupted iterations
default   [  89% ] 10 VUs  1m47.0s/2m0s

running (1m48.0s), 10/10 VUs, 5281 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  1m48.0s/2m0s

running (1m49.0s), 10/10 VUs, 5331 complete and 0 interrupted iterations
default   [  91% ] 10 VUs  1m49.0s/2m0s

running (1m50.0s), 10/10 VUs, 5381 complete and 0 interrupted iterations
default   [  92% ] 10 VUs  1m50.0s/2m0s

running (1m51.0s), 10/10 VUs, 5428 complete and 0 interrupted iterations
default   [  92% ] 10 VUs  1m51.0s/2m0s

running (1m52.0s), 10/10 VUs, 5478 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  1m52.0s/2m0s

running (1m53.0s), 10/10 VUs, 5523 complete and 0 interrupted iterations
default   [  94% ] 10 VUs  1m53.0s/2m0s

running (1m54.0s), 10/10 VUs, 5571 complete and 0 interrupted iterations
default   [  95% ] 10 VUs  1m54.0s/2m0s

running (1m55.0s), 10/10 VUs, 5621 complete and 0 interrupted iterations
default   [  96% ] 10 VUs  1m55.0s/2m0s

running (1m56.0s), 10/10 VUs, 5671 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  1m56.0s/2m0s

running (1m57.0s), 10/10 VUs, 5721 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  1m57.0s/2m0s

running (1m58.0s), 10/10 VUs, 5771 complete and 0 interrupted iterations
default   [  98% ] 10 VUs  1m58.0s/2m0s

running (1m59.0s), 10/10 VUs, 5821 complete and 0 interrupted iterations
default   [  99% ] 10 VUs  1m59.0s/2m0s

running (2m00.0s), 10/10 VUs, 5871 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  2m00.0s/2m0s

     ✓ status is 200

     checks.........................: 100.00% 5881 out of 5881
     data_received..................: 2.4 MB  20 kB/s
     data_sent......................: 523 kB  4.4 kB/s
     http_req_blocked...............: avg=7.15µs   min=1.69µs   med=4.89µs   max=1.92ms   p(90)=7.07µs   p(95)=8.76µs  
     http_req_connecting............: avg=1.09µs   min=0s       med=0s       max=1.89ms   p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=3.62ms   min=1.96ms   med=3.13ms   max=35.41ms  p(90)=4.73ms   p(95)=6.11ms  
       { expected_response:true }...: avg=3.62ms   min=1.96ms   med=3.13ms   max=35.41ms  p(90)=4.73ms   p(95)=6.11ms  
   ✓ http_req_failed................: 0.00%   0 out of 5881
     http_req_receiving.............: avg=61.7µs   min=12.48µs  med=49.83µs  max=1.67ms   p(90)=83.09µs  p(95)=131.87µs
     http_req_sending...............: avg=17.67µs  min=5.19µs   med=13.68µs  max=3.05ms   p(90)=23.28µs  p(95)=27.23µs 
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=3.54ms   min=1.92ms   med=3.05ms   max=35.35ms  p(90)=4.66ms   p(95)=6ms     
     http_reqs......................: 5881    48.92701/s
     iteration_duration.............: avg=204.29ms min=202.22ms med=203.81ms max=236.31ms p(90)=205.53ms p(95)=206.88ms
     iterations.....................: 5881    48.92701/s
     vus............................: 10      min=10           max=10
     vus_max........................: 10      min=10           max=10


running (2m00.2s), 00/10 VUs, 5881 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  2m0s
k6 exit code: 0 (0 = zero failed requests)